packages/backend/artillery/artillery-performance.yml
# Artillery Performance Test Configuration
# Story 5-3a: Performance Baseline Measurement (Post-Migration)
#
# Target: Hexagonal Architecture Backend
# NFR-4: API Response Time <200ms p95
#
# Phases:
#   - Warmup: 60s @ 5 RPS (Virtual Users ankommen lassen)
#   - Sustained Load: 120s @ 20 RPS (Hauptmessphase)
#
# Endpoints getestet (AC2):
#   - POST /api/alpha/einsatz (Create Einsatz)
#   - GET /api/alpha/einsatz (Get All Einsätze)
#   - GET /api/alpha/einsatz/:id/details (Einsatz mit ETB/Lagekarte)
#   - POST /api/alpha/etb/:etbId/eintrag (ETB-Eintrag hinzufügen)
#   - POST /api/alpha/einsatz/:id/complete (Einsatz abschließen)
#   - GET /api/alpha/einsatz/active-with-counts (Dashboard Query)

config:
  target: 'http://localhost:3090'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warmup (60s @ 5 RPS)"
    - duration: 120
      arrivalRate: 20
      name: "Sustained Load (120s @ 20 RPS)"
  processor: "./artillery-helpers.js"
  defaults:
    headers:
      Content-Type: "application/json"
  # Plugins für detaillierte Metriken
  plugins:
    expect: {}
  # Metriken-Konfiguration
  ensure:
    p95: 200  # NFR-4: p95 Response Time <200ms

scenarios:
  # Scenario 1: Create Einsatz (Weight: 20%)
  # Simuliert das Erstellen neuer Einsätze durch Leitstelle
  - name: "Create Einsatz"
    weight: 20
    flow:
      - function: "setAuthHeader"
      - function: "generateEinsatzPayload"
      - post:
          url: "/api/alpha/einsatz"
          json: "{{ einsatzPayload }}"
          capture:
            - json: "$.data.id"
              as: "createdEinsatzId"
            - json: "$.data.etbId"
              as: "createdEtbId"
          expect:
            - statusCode: 201
            - hasProperty: "data.id"
            - hasProperty: "data.nummer"

  # Scenario 2: Get All Einsätze (Weight: 30%)
  # Simuliert das Laden der Einsatz-Liste (häufigste Operation)
  - name: "Get All Einsätze"
    weight: 30
    flow:
      - function: "setAuthHeader"
      - get:
          url: "/api/alpha/einsatz"
          qs:
            page: 1
            limit: 10
            includeArchived: false
          expect:
            - statusCode: 200
            - hasProperty: "data"

  # Scenario 3: Dashboard Query (Weight: 20%)
  # Simuliert den Dashboard-Aufruf mit aggregierten Daten
  - name: "Dashboard Query (Active with Counts)"
    weight: 20
    flow:
      - function: "setAuthHeader"
      - get:
          url: "/api/alpha/einsatz/active-with-counts"
          expect:
            - statusCode: 200
            # Response ist Array ohne Wrapper (SkipTransform)

  # Scenario 4: Get Einsatz Details (Weight: 15%)
  # Simuliert das Laden eines einzelnen Einsatzes mit ETB und Lagekarte
  # Erfordert erst einen Create um gültige ID zu haben
  - name: "Get Einsatz Details"
    weight: 15
    flow:
      - function: "setAuthHeader"
      - function: "generateEinsatzPayload"
      # Erst Einsatz erstellen um gültige ID zu bekommen
      - post:
          url: "/api/alpha/einsatz"
          json: "{{ einsatzPayload }}"
          capture:
            - json: "$.data.id"
              as: "einsatzId"
      # Dann Details abrufen
      - get:
          url: "/api/alpha/einsatz/{{ einsatzId }}/details"
          expect:
            - statusCode: 200
            - hasProperty: "data.einsatz"

  # Scenario 5: Add ETB Eintrag (Weight: 10%)
  # Simuliert das Hinzufügen von Einträgen zum Einsatztagebuch
  - name: "Add ETB Eintrag"
    weight: 10
    flow:
      - function: "setAuthHeader"
      - function: "generateEinsatzPayload"
      - function: "generateEtbEintragPayload"
      # Erst Einsatz erstellen um ETB-ID zu bekommen
      - post:
          url: "/api/alpha/einsatz"
          json: "{{ einsatzPayload }}"
          capture:
            - json: "$.data.id"
              as: "einsatzId"
      # ETB-Eintrag hinzufügen (ETB wird automatisch erstellt)
      - post:
          url: "/api/alpha/etb/{{ einsatzId }}/eintrag"
          json:
            text: "{{ etbEintragPayload.text }}"
            kategorie: "{{ etbEintragPayload.kategorie }}"
            einsatzId: "{{ einsatzId }}"
          expect:
            - statusCode: 201
            - hasProperty: "data.id"
            - hasProperty: "data.sequenceNumber"

  # Scenario 6: Complete Einsatz (Weight: 5%)
  # Simuliert das Abschließen eines Einsatzes
  # Selten (nur 5% der Last), aber wichtiger Workflow
  - name: "Complete Einsatz"
    weight: 5
    flow:
      - function: "setAuthHeader"
      - function: "generateEinsatzPayload"
      # Erst Einsatz erstellen
      - post:
          url: "/api/alpha/einsatz"
          json: "{{ einsatzPayload }}"
          capture:
            - json: "$.data.id"
              as: "einsatzId"
      # Dann abschließen
      - post:
          url: "/api/alpha/einsatz/{{ einsatzId }}/complete"
          expect:
            - statusCode: 200
            - hasProperty: "data.status"